Revit 2027 API
NurbsSurfaceData.GetWeights Method
 Get the list of weights.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetWeights()
Public Function GetWeights As IList(Of Double)
public:
IList<double>^ GetWeights()
member GetWeights : unit -> IList<float>
Return Value
IList<Double>
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace